# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import sqlite3
import pandas as pd

In [3]:
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [4]:
#Your code here
cur.execute("""select firstName, lastName 
                    from employees 
                    join offices using(officeCode) 
                    where city = 'Boston';""")
cur.fetchall()

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?

In [9]:
#Your code here
cur.execute("""select city, count(*)
                    from offices
                    join employees
                    using(officeCode)
                    group by 1;""")
df = pd.DataFrame(cur.fetchall())
df.head()

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6

## Write 3 Questions of your own and answer them

#### Answers will vary
1. Where are the customer located
2. What products and how much
3. payment amount

In [11]:
# Your code here
cur.execute('''select state, count(*) from customers
                    group by 1;''')
cur.fetchall()

[('', 73),
 ('BC', 2),
 ('CA', 11),
 ('CT', 4),
 ('Co. Cork', 1),
 ('Isle of Wight', 1),
 ('MA', 9),
 ('NH', 1),
 ('NJ', 1),
 ('NSW', 2),
 ('NV', 1),
 ('NY', 6),
 ('Osaka', 1),
 ('PA', 3),
 ('Pretoria', 1),
 ('Queensland', 1),
 ('Qu√©bec', 1),
 ('Tokyo', 1),
 ('Victoria', 2)]

In [13]:
# Your code here
cur.execute('''select productName, quantityOrdered from orderdetails
                    join products
                    using(productCode)
                    limit 10;
                    ''')
cur.fetchall()

[('1917 Grand Touring Sedan', '30'),
 ('1911 Ford Town Car', '50'),
 ('1932 Alfa Romeo 8C2300 Spider Sport', '22'),
 ('1936 Mercedes Benz 500k Roadster', '49'),
 ('1932 Model A Ford J-Coupe', '25'),
 ('1928 Mercedes-Benz SSK', '26'),
 ('1939 Chevrolet Deluxe Coupe', '45'),
 ('1938 Cadillac V-16 Presidential Limousine', '46'),
 ('1937 Lincoln Berline', '39'),
 ('1936 Mercedes-Benz 500K Special Roadster', '41')]

In [22]:
# Your code here
cur.execute('''select pd.productName, p.amount 
                    from payments p
                    join customers c
                    using(customerNumber)
                    join orders o
                    using(customerNumber)
                    join orderdetails od
                    using(orderNumber)
                    join products pd
                    using(productCode);''')
df = pd.DataFrame(cur.fetchall())
df.head()

                                0        1
0           1965 Aston Martin DB5  6066.78
1    1999 Indy 500 Monte Carlo SS  6066.78
2  1948 Porsche Type 356 Roadster  6066.78
3       1966 Shelby Cobra 427 S/C  6066.78
4           1996 Moto Guzzi 1100i  6066.78

## Level Up: Display the names of each product each employee has sold.

In [23]:
# Your code here
cur.execute('''select e.firstName, e.lastName, p.productName
                      from employees e
                      join customers c
                      on e.employeeNumber = c.salesRepEmployeeNumber
                      join orders o
                      using(customerNumber)
                      join orderdetails od
                      using(orderNumber)
                      join products p
                      using(productCode);''')
df = pd.DataFrame(cur.fetchall())
df.head()

        0         1                                            2
0  Leslie  Jennings                               1958 Setra Bus
1  Leslie  Jennings                       1940 Ford Pickup Truck
2  Leslie  Jennings                      1939 Cadillac Limousine
3  Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each Employee Has sold

In [24]:
#Your code here
df.groupby([0,1]).count()

                      2
0        1
Andy     Fixter     185
Barry    Jones      220
Foon Yue Tseng      142
George   Vanauf     211
Gerard   Hernandez  396
Julie    Firrelli   124
Larry    Bott       236
Leslie   Jennings   331
         Thompson   114
Loui     Bondur     177
Mami     Nishi      137
Martin   Gerard     114
Pamela   Castillo   272
Peter    Marsh      185
Steve    Patterson  152

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!